INSERT INTO users VALUES 
	(DEFAULT,'Guadalupe','Nitzsche','greenfelder.antwan@example.org','89213456678','d6f684fe75bdff654841d18f34c9acd6d3b05233','2011-12-04 16:57:02',DEFAULT),
	(DEFAULT,'Elmira','Bayer','xjacobs@example.org','89214507878','501a9b34edb153894128f6255ff3ef6bf0d3f4db','2004-01-20 18:48:26',DEFAULT),
	(DEFAULT,'D\'angelo','Cruickshank','linwood.medhurst@example.org','89214567878','3273c607f8dfbc808adaa5493b7439ba08c3f43e','2006-09-04 15:21:06',DEFAULT),
	(DEFAULT,'Princess','Runolfsson','huel.nash@example.org','89213455643','21444980cef626302f7ae9a507971889c9daac1d','2004-08-27 19:05:04',DEFAULT),
	(DEFAULT,'Ethan','Legros','mhickle@example.org','89219567878','4dd91825495d2233602c0b0af6ff8b113b1844d9','2003-01-08 23:58:41',DEFAULT),
	(DEFAULT,'Freda','Sporer','devyn70@example.net','89213457870','3df01bfd0a99988ca0383a49481e523226d4adca','2017-11-10 19:45:09',DEFAULT),
	(DEFAULT,'Bonnie','Prosacco','hester.marvin@example.com','89213332222','10db70a3dcce2a22dd8eabdc7342260c91ff1749','2012-09-30 14:12:03',DEFAULT),
	(DEFAULT,'Sierra','Bruen','aprosacco@example.net','89212222334','99fbaa12eecf0e10bf372dbf9cf7f98267b6636e','2014-01-28 04:41:46',DEFAULT),
	(DEFAULT,'Trudie','Heller','hjohnston@example.net','89213336675','33b1681186add7816a701f570615c9d0aae215ab','2009-06-10 12:49:14',DEFAULT),
	(DEFAULT,'Shaylee','Sawayn','pagac.clarissa@example.org','89212233456','b1771cc64742c38ec18ac67a4e61597b05cc9e20','2013-12-14 01:24:44',DEFAULT),
	(DEFAULT,'Demarco','Eichmann','lakin.ethel@example.org','89233388787','f7f50eddf4d112d2d858510211128b8e0de60f84','2006-02-22 14:32:06',DEFAULT),
	(DEFAULT,'Yolanda','Lueilwitz','tiffany68@example.com','89376051734','2501193f8541d7b6824334ad86b5f96e6a9b9308','2012-08-31 07:33:18',DEFAULT),
	(DEFAULT,'Enos','Lebsack','alessandra.adams@example.org','89362477275','ab2e8f19f21b18eda464b03cd1b28c06027f2252','2009-11-15 20:27:38',DEFAULT),
	(DEFAULT,'Martin','Zulauf','osbaldo.feeney@example.net','89443615485','8b5ba4f4921f09d6bac6d71e709dca2414679941','2020-10-23 07:54:11',DEFAULT),
	(DEFAULT,'Rozella','Ledner','botsford.darrick@example.net','89556983555','e3fecea044eea5282b2666793a25d00b79d1647e','2010-07-10 21:01:19',DEFAULT),
	(DEFAULT,'Lyla','Kuhlman','maureen.hahn@example.net','89863396493','96ff5ae80edeb6d3d94aa5a4a9d3cdd460d226c1','2021-03-26 05:12:41',DEFAULT),
	(DEFAULT,'Vesta','Stark','ullrich.maia@example.org','89965273095','cf4a0a8d00e7b7da2446658ff8031dfa8d57effe','2015-08-17 00:55:06',DEFAULT),
	(DEFAULT,'Cynthia','Jacobson','darian.predovic@example.org','89915244874','73231315088b43fcb26bf682034713aeec6a6c1f','2016-04-03 19:03:32',DEFAULT),
	(DEFAULT,'Roselyn','Wyman','isabelle28@example.net','89811630070','263519d1df77c266cec0f3718e519c38c9efa6d0','2017-01-09 03:20:56',DEFAULT),
	(DEFAULT,'Tomasa','Ziemann','sawayn.dedrick@example.com','89606439300','166cb7322d95d6214a2e18f5c89b8ddea1459e9f','2015-12-02 09:10:47',DEFAULT),
	(DEFAULT,'Louie','Berge','bartoletti.cathryn@example.net','89894776374','1ea3e0a63d012e0fa826683afd9b0172a965cac1','2011-04-25 16:26:33',DEFAULT),
	(DEFAULT,'Jalyn','Keeling','brionna.collier@example.com','89742583935','bbf7f2a003177fce59d887dc2a61996fb7b8ffdb','2014-09-06 10:04:06',DEFAULT),
	(DEFAULT,'Evans','Stehr','jones.josefina@example.org','89686892318','59d97f7a7ec4ce2d35e965ad1811e95552069640','2019-09-04 08:39:01',DEFAULT),
	(DEFAULT,'Kieran','Kuhlman','johnpaul53@example.org','89754628999','ee3c139b89e87f25e549ea0c965fc6e90021d37b','2017-10-19 16:11:28',DEFAULT),
	(DEFAULT,'Morris','Grant','josiah54@example.org','89803321866','7576e7ec3f5b49b89851133ec2bdf14b5d545d5f','2014-05-08 21:46:14',DEFAULT),
	(DEFAULT,'Tamara','Cronin','genesis26@example.net','89912578752','4415627561c27acd6de49148925027d0aec7c0b2','2015-11-09 07:45:21',DEFAULT),
	(DEFAULT,'Dashawn','Reichel','steuber.sid@example.org','89666650214','5b8aa47fd1e429e19d0447905b442b3166ef0562','2019-12-16 21:22:28',DEFAULT),
	(DEFAULT,'Maud','Kovacek','kaylah93@example.org','89481627255','225d34bf328eadcd083832d555e3fba2253e7d25','2019-08-16 15:19:01',DEFAULT),
	(DEFAULT,'Treva','Hettinger','micaela.green@example.com','89358379383','b5df45925be41d555db72bdfceeb9238c2fddfcc','2020-10-15 21:52:50',DEFAULT),
	(DEFAULT,'Adolph','Buckridge','gfeest@example.net','89758072702','eb993a5b09bf844fdccd77b47bbba9431f16fc87','2016-02-04 11:05:48',DEFAULT);

SELECT * FROM users;

INSERT INTO profiles VALUES
	(1,'m','1989-04-09',1,'Австрия','Гамильфурт'),
	(2,'x','1991-11-11',13,'Россия','Москва'),
	(3,'f','2000-10-01',NULL,'Россия','Москва'),
	(4,'f','1977-12-18',NULL,'США','Нью-Йорк'),
	(5,'f','1985-10-14',5,'США','Рафаэльестад'),
	(6,'x','2006-12-02',17,'США','Филадельфия'),
	(7,'x','2014-12-27',NULL,'Россия','Санкт-Петербург'),
	(8,'x','1970-04-06',NULL,'Канада','Торонто'),
	(9,'x','2020-02-28',9,'Канада','Анабельестад'),
	(10,'m','1992-01-27',21,'Германия','Берлин'),
	(11,'x','2002-04-29',NULL,'Франция','Париж'),
	(12,'f','1989-08-02',94,'США','Атланта'),
	(13,'m','1961-08-11',42,'Россия','Казань'),
	(14,'m','1977-07-27',53,'США','Дэли-Сити'),
	(15,'m','1964-12-23',81,'США','Бирмингем'),
	(16,'x','1970-11-11',33,'Россия','Самара'),
	(17,'x','1982-09-09',72,'Великобритания','Уэльс'),
	(18,'f','1978-10-22',43,'Сербия','Уотерсшир'),
	(19,'m','1978-03-21',56,'США','Бруклин'),
	(20,'m','1968-07-03',11,'Россия','Москва'),
	(21,'x','1953-12-05',6,'Парагвай','Леднерчестер'),
	(22,'x','1993-03-28',39,'Россия','Екатеринбург'),
	(23,'x','1962-12-30',14,'Россия','Москва'),
	(24,'x','1989-07-24',85,'Боливия','Порт Джарод'),
	(25,'x','2009-04-04',76,'США','Рафаэльестад'),
	(26,'f','1971-05-10',18,'Канада','Торонто'),
	(27,'f','1993-12-03',35,'Россия','Санкт-Петербург'),
	(28,'f','1971-03-20',80,'Россия','Москва'),
	(29,'f','1996-02-07',8,'США','Бруклин'),
	(30,'x','1994-08-07',54,'Великобритания','Южный Хезерфурт');
	
SELECT * FROM profiles;

INSERT INTO films VALUES
	(DEFAULT,'The Whole Nine Yards', 'Девять ярдов', 'Дантист Николас Озерански вёл спокойную и размеренную жизнь. Но знакомство с новым соседом Джимми Тюльпаном положило ей конец раз и навсегда. Тюльпан был профессиональным убийцей и украл у своего босса десять миллионов долларов. А жена Николаса - Софи - решила сдать Джимми его бывшему боссу.','2000-02-17','США'),
	(DEFAULT,'300', '300 спартанцев','События картины повествуют о кровопролитной битве при Фермопилах в 480 году до н.э., в которой триста отважных спартанцев во главе со своим царем Леонидом преградили путь многотысячной армии персидского царя Ксеркса. Несмотря на численный перевес персов, спартанцы продолжали упорную оборону, проявив мужество и отвагу. Их бесстрашие и героизм вдохновили всю Грецию на объединение против непобедимого врага, переломив тем самым ход Греко-персидских войн…','2006-12-09','США'),
	(DEFAULT,NULL,'Особенности национальной охоты', 'Молодой финский специалист по охоте, «финик», уговаривает своего русского друга помочь ему поучаствовать в настоящей русской охоте, дабы познакомиться с нравами и привычками русских охотников.','1995-09-08','Россия'),
	(DEFAULT,'Rush Hour','Час пик','В Лос-Анджелесе злодеи похищают малолетнюю дочь китайского консула, которую в Гонконге учил кунг-фу инспектор Ли. Консул вызывает Ли в Америку, чтобы тот принял участие в освобождении девочки.','1998-09-19','США'),
	(DEFAULT,'Despicable Me','Гадкий я','Гадкий снаружи, но добрый внутри Грю намерен, тем не менее, закрепить за собой статус главного архизлодея в мире, для чего он решает выкрасть Луну при помощи созданной им армии миньонов. Дело осложняют конкуренты, вставляющие высокотехнические палки в колеса, и семейные обстоятельства в виде трех сироток, о которых Грю вынужден заботиться.','2010-06-27','США'),
	(DEFAULT,'RocknRolla','Рок-н-рольщик','Опасный мир коррупции и жизни криминальных отбросов Лондона, где недвижимость потеснила такого лидера торгового рынка как наркотики, а самыми активными предпринимателями стали преступные группировки. Но каждому, кто хочет проворачивать там свои дела, будь то мелкая сошка Раз-Два или русский теневой миллиардер Юрий Омович, придется сначала договориться с одним человеком – Ленни Коулом.','2008-09-04','США'),
	(DEFAULT,'Ace Ventura: Pet Detective','Эйс Вентура: Розыск домашних животных','Он - лучший в своем деле, единственный и неповторимый! Он - Эйс Вентура, детектив по розыску домашних любимцев. Когда таинственные злоумышленники похищают дельфина по кличке Снежинка, талисман местной футбольной команды «Дельфины», Эйс тут же приступает к работе, проявляя чудеса изобретательности.','1994-02-04','США'),
	(DEFAULT,'The Fifth Element','Пятый элемент','Каждые пять тысяч лет открываются двери между измерениями и темные силы стремятся нарушить существующую гармонию. Каждые пять тысяч лет Вселенной нужен герой, способный противостоять этому злу. XXIII век. Нью-йоркский таксист Корбен Даллас должен решить глобальную задачу - спасение всего рода человеческого.','1997-05-07','США'),
	(DEFAULT,'Yes Man','Всегда говори «ДА»','Депрессивный главный герой всегда и всем говорил «нет» — например, друзьям, если они зовут куда-то. Но в один прекрасный день он заключает соглашение, по которому всегда должен отвечать «Да» на любое предложение...','2008-12-09','США'),
	(DEFAULT,'The Hitchhiker\'s Guide to the Galaxy','Автостопом по галактике','В один прекрасный день над Землей нависли огромные звездолеты инопланетян, и людям объявили, что их родная планета подлежит сносу, а на ее месте будет проложено шикарное межзвездное шоссе. Н-да, не повезло человечеству. Кроме самого заурядного парня по имени Артур Дент, старый друг и собутыльник которого Форд Префект оказался... инопланетянином!','2005-04-20','Великобритания'),
	(DEFAULT,'Office Space','Офисное пространство','Питер Гиббонс после неудачного сеанса гипноза становится человеком с поменявшимися жизненными взглядами. Его новая философия — «забей на работу». Если он и показывается теперь в офисе, то только для того, чтобы играть в компьютерные игры, нарушать внутренний распорядок, а также говорить своему боссу, куда тому следует засунуть свои идиотские распоряжения. Но подобные действия, как ни странно, только поднимают его авторитет, зарплату и должность. Используя новые возможности, он разрабатывает схему присвоения чужих денег.','1999-02-19','США');

SELECT id, title FROM films;

INSERT INTO genres VALUES
	(DEFAULT,'Комедия'),
	(DEFAULT,'Фантастика'),
	(DEFAULT,'Приключения'),
	(DEFAULT,'Криминал'),
	(DEFAULT,'Боевик'),
	(DEFAULT,'Драма'),
	(DEFAULT,'Триллер'),
	(DEFAULT,'Мультфильм'),
	(DEFAULT,'Фэнтези'),
	(DEFAULT,'Семейный'),
	(DEFAULT,'Мелодрама'),
	(DEFAULT,'Спорт'),
	(DEFAULT,'Детектив');

SELECT * FROM genres;


-- вписываю только первых пять актеров в фильме
INSERT INTO celebrities VALUES
	(DEFAULT,'Рон','Ливингстон','m','1967-06-05','Кедар-Рапидс','США',120,10,'2003-11-07',DEFAULT),
	(DEFAULT,'Дженнифер','Энистон','f','1969-02-11','Шерман Оукс','США',224,11,'2003-11-07',DEFAULT),
	(DEFAULT,'Дэвид','Херман','m','1967-02-20','Нью-Йорк','США',73,12,'2003-11-07',DEFAULT),
	(DEFAULT,'Аджай','Найду','m','1972-02-12','Эванстон','США',93,13,'2003-11-07',DEFAULT),
	(DEFAULT,'Дидрих','Бадер','m','1966-12-24','Алегзандрия','США',224,14,'2003-11-07',DEFAULT),
	(DEFAULT,'Мартин','Фриман','m','1971-09-08','Олдершот','Великобритания',151,15,'2003-11-07',DEFAULT),
	(DEFAULT,'Ясин','Бей','m','1973-12-11','Бруклин','США',86,16,'2003-11-07',DEFAULT),
	(DEFAULT,'Сэм','Рокуэлл','m','1968-11-05','Дэли-Сити','США',172,17,'2003-11-07',DEFAULT),
	(DEFAULT,'Зои','Дешанель','f','1980-01-17','Лос-Анджелес','США',123,18,'2003-11-07',DEFAULT),
	(DEFAULT,'Билл','Найи','m','1949-12-12','Катерхэм','Великобритания',178,19,'2003-11-07',DEFAULT),
	(DEFAULT,'Брюс','Уиллис','m','1955-03-19','Идар-Оберштайн','ФРГ',328,20,'2003-11-07',DEFAULT),
	(DEFAULT,'Мэттью','Перри','m','1969-08-19','Уильямстаун','США',139,21,'2003-11-07',DEFAULT),
	(DEFAULT,'Розанна','Аркетт','f','1959-08-10','Нью-Йорк','США',218,22,'2003-11-07',DEFAULT),
	(DEFAULT,'Майкл','Дункан','m','1957-12-10','Лос-Анджелес','США',144,23,'2003-11-07',DEFAULT),
	(DEFAULT,'Наташа','Хенстридж','f','1974-08-15','Спрингдэйл','Канада',100,24,'2003-11-07',DEFAULT),
	(DEFAULT,'Джерард','Батлер','m','1969-11-13','Пейсли','Великобритания',141,25,'2003-11-07',DEFAULT),
	(DEFAULT,'Майкл','Фассбендер','m','1977-04-02','Хайдельберг','ФРГ',130,26,'2003-11-07',DEFAULT),
	(DEFAULT,'Винсент','Риган','m','1965-05-16','Суонси','Великобритания',105,27,'2003-11-07',DEFAULT),
	(DEFAULT,'Дэвид','Уэнэм','m','1965-09-21','Марриквилл','Австралия',107,28,'2003-11-07',DEFAULT),
	(DEFAULT,'Лина','Хиди','f','1973-10-03','Бермуды','Великобритания',131,29,'2003-11-07',DEFAULT),
	(DEFAULT,'Вилле','Хаапасало','m','1972-02-28','Лахти','Финляндия',67,30,'2003-11-07',DEFAULT),
	(DEFAULT,'Алексей','Булдаков','m','1951-03-26','Макаровка','СССР',165,31,'2003-11-07',DEFAULT),
	(DEFAULT,'Виктор','Бычков','m','1954-09-04','Ленинград','СССР',106,32,'2003-11-07',DEFAULT),
	(DEFAULT,'Семён','Стругачев','m','1957-12-10','Смидовичи','СССР',61,33,'2003-11-07',DEFAULT),
	(DEFAULT,'Сергей','Куприянов','m','1971-05-06',NULL,NULL,93,34,'2003-11-07',DEFAULT),
	(DEFAULT,'Джеки','Чан','m','1954-04-07',NULL,'Гонконг',297,35,'2003-11-07',DEFAULT),
	(DEFAULT,'Крис','Такер','m','1971-08-31','Атланта','США',89,36,'2003-11-07',DEFAULT),
	(DEFAULT,'Элизабет','Пенья','f','1959-09-23','Лос-Анджелес','США',113,37,'2003-11-07',DEFAULT),
	(DEFAULT,'Том','Уилкинсон','m','1948-02-05','Лидс','Великобритания',144,38,'2003-11-07',DEFAULT),
	(DEFAULT,'Кен','Люн','m','1970-01-21','Нью-Йорк','США',56,39,'2003-11-07',DEFAULT),
	(DEFAULT,'Тандиве','Ньютон','f','1972-11-06','Лондон','Великобритания',111,40,'2003-11-07',DEFAULT),
	(DEFAULT,'Марк','Стронг','m','1963-08-05','Лондон','Великобритания',131,41,'2003-11-07',DEFAULT),
	(DEFAULT,'Идрис','Эльба','m','1972-09-06','Лондон','Великобритания',185,42,'2003-11-07',DEFAULT),
	(DEFAULT,'Стив','Карелл','m','1962-08-16','Конкорд','США',215,43,'2003-11-07',DEFAULT),
	(DEFAULT,'Джейсон','Сигел','m','1980-01-18','Лос-Анджелес','США',105,44,'2003-11-07',DEFAULT),
	(DEFAULT,'Расселл','Брэнд','m','1975-06-04','Грейс','Великобритания',158,45,'2003-11-07',DEFAULT),
	(DEFAULT,'Джули','Эндрюс','f','1935-10-01','Уолтон-он-Темс','Великобритания',197,46,'2003-11-07',DEFAULT),
	(DEFAULT,'Уилл','Арнетт','m','1970-05-05','Торонто','Канада',190,47,'2003-11-07',DEFAULT),
	(DEFAULT,'Милла','Йовович','f','1975-12-17','Киев','Украина',126,48,'2003-11-07',DEFAULT),
	(DEFAULT,'Гари','Олдман','m','1958-08-21','Лондон','Великобритания',177,49,'2003-11-07',DEFAULT),
	(DEFAULT,'Иэн','Холм','m','1931-06-19','Лондон','Великобритания',160,50,'2003-11-07',DEFAULT),
	(DEFAULT,'Джим','Керри','m','1962-01-17','Ньюмаркет','Канада',229,51,'2003-11-07',DEFAULT),
	(DEFAULT,'Кортни','Кокс','f','1964-06-15','Бирмингем','США',159,52,'2003-11-07',DEFAULT),
	(DEFAULT,'Шон','Янг','f','1959-11-20','Луисвилл','США',163,53,'2003-11-07',DEFAULT),
	(DEFAULT,'Тоун','Лок','m','1966-03-03','Лос-Анджелес','США',58,54,'2003-11-07',DEFAULT),
	(DEFAULT,'Дэн','Марино','m','1962-01-17','Питтсбург','США',30,55,'2003-11-07',DEFAULT),
	(DEFAULT,'Брэдли','Купер','m','1975-01-05','Филадельфия','США',184,56,'2003-11-07',DEFAULT),
	(DEFAULT,'Джон','Хиггинс','m','1963-02-12','Бостон','США',159,57,'2003-11-07',DEFAULT),
	(DEFAULT,'Риз','Дэрби','m','1974-03-21',NULL,'Новая Зеландия',93,58,'2003-11-07',DEFAULT);

SELECT * FROM celebrities;

INSERT INTO films_genres VALUES	(1,1),	(1,4),	(2,5),	(2,6),	(3,1),	(4,5),	(4,1),	(4,7),	(4,4),	(5,8),	(5,9),	(5,1),	(5,4),	(5,10),	(6,4),	(6,5),	(6,7),	(7,1),	(7,13),	(7,3),	(8,2),	(8,5),	(8,7),	(8,1),	(9,1),	(10,2),	(10,1),	(10,3),	(11,1);

SELECT * FROM films_genres;

INSERT INTO	film_actors VALUES (1,1), (1,2), (1,3), (1,4), (1,5), (2,6), (2,7), (2,8),(2,9),(2,10),(3,11),(3,12),(3,13),(3,14),(3,15),(4,16),(4,17),(4,18),(4,19),(4,20),(5,21),(5,22),(5,23),(5,24),(5,25),(6,26),(6,27),(6,28),(6,29),(6,30),(7,16),(7,29),(7,31),(7,32),(7,33),(8,34),(8,35),(8,36),(8,37),(8,38),(9,11),(9,27),(9,39),(9,40),(9,41),(10,42),(10,43),(10,44),(10,45),(10,46),(11,42),(11,9),(11,47),(11,48),(11,49);

SELECT * FROM film_actors;

INSERT INTO media VALUES (1,15,NULL,6,2,'aut',1100,'2014-07-21 05:19:13'),(2,17,NULL,9,1,'libero',866,'2016-12-17 10:20:26'),(3,16,17,5,3,'et',1846,'2010-02-24 21:56:43'),(4,19,28,5,1,'sunt',707,'2010-10-29 05:08:09'),(5,14,31,5,2,'earum',1353,'2016-09-04 09:49:21'),(6,2,13,6,3,'accusantium',767,'2009-07-07 16:07:09'),(7,10,NULL,5,1,'et',783,'2020-04-23 06:28:33'),(8,3,NULL,10,3,'nostrum',1387,'2006-05-23 12:17:05'),(9,3,46,1,2,'id',1448,'2018-10-25 05:43:42'),(10,11,NULL,3,3,'voluptate',1165,'2012-06-20 04:52:37'),(11,28,NULL,4,1,'quasi',602,'2006-07-21 14:30:36'),(12,16,17,2,3,'non',1065,'2013-08-12 15:36:56'),(13,28,NULL,2,1,'tempore',1978,'2006-10-27 07:24:08'),(14,18,NULL,7,1,'quasi',657,'2020-01-10 08:43:52'),(15,21,6,9,2,'cumque',1450,'2020-04-20 11:27:03'),(16,2,17,1,2,'molestiae',1970,'2008-12-27 01:37:42'),(17,23,10,6,1,'et',838,'2009-12-30 00:39:25'),(18,9,NULL,4,1,'alias',714,'2006-08-06 17:16:14'),(19,28,NULL,7,3,'id',626,'2013-06-24 14:43:26'),(20,7,4,1,2,'consectetur',1799,'2017-08-17 12:41:53'),(21,27,34,8,3,'quo',1921,'2015-10-03 22:51:54'),(22,14,24,8,3,'ea',920,'2014-05-09 15:30:43'),(23,30,NULL,11,2,'et',1290,'2015-12-03 14:30:37'),(24,12,NULL,11,2,'nostrum',1426,'2006-09-24 19:37:19'),(25,7,20,2,2,'eius',1139,'2006-12-16 01:22:05'),(26,13,NULL,10,1,'qui',1793,'2019-07-29 19:33:32'),(27,19,16,8,1,'suscipit',1479,'2012-06-11 09:33:25'),(28,11,NULL,1,3,'quas',1381,'2009-03-14 05:39:01'),(29,13,21,7,1,'veniam',1165,'2018-03-17 22:05:48'),(30,13,NULL,4,1,'sit',723,'2013-06-25 12:00:56'),(31,8,NULL,8,1,'ea',1200,'2007-04-14 05:15:48'),(32,7,NULL,9,3,'quia',680,'2021-03-19 11:12:51'),(33,19,NULL,4,2,'et',1725,'2009-09-08 00:59:05'),(34,17,35,9,3,'omnis',1705,'2013-05-15 10:47:09'),(35,23,33,5,1,'nulla',839,'2006-06-05 06:52:43'),(36,15,NULL,3,2,'aut',944,'2016-09-11 21:26:33'),(37,16,NULL,4,3,'consequatur',729,'2011-12-12 04:10:05'),(38,10,37,10,3,'ratione',1994,'2018-03-09 13:27:54'),(39,20,26,8,1,'animi',1531,'2008-05-02 17:16:55'),(40,12,34,2,1,'qui',1508,'2015-04-05 17:37:16'),(41,4,NULL,3,2,'tempore',1427,'2015-05-01 20:40:24'),(42,17,NULL,8,3,'nam',1506,'2020-01-17 11:47:06'),(43,30,23,6,1,'cumque',1131,'2012-07-28 19:28:47'),(44,24,NULL,7,2,'est',838,'2019-04-14 08:27:46'),(45,29,NULL,3,3,'qui',1360,'2019-02-13 13:33:23'),(46,4,42,3,1,'sunt',799,'2018-02-14 22:46:44'),(47,27,33,6,1,'qui',1295,'2006-09-28 13:56:32'),(48,6,NULL,6,3,'repellendus',1709,'2007-10-19 04:57:42'),(49,11,12,3,1,'quia',1261,'2011-01-12 08:46:30'),(50,7,NULL,4,1,'et',1218,'2013-02-18 06:30:00'),(51,3,39,7,1,'sequi',1478,'2015-08-01 20:36:13'),(52,25,NULL,7,2,'hic',1225,'2011-10-14 23:50:52'),(53,3,12,4,3,'iusto',772,'2010-12-19 04:31:10'),(54,5,26,10,1,'consectetur',1034,'2017-05-13 04:47:08'),(55,25,NULL,8,3,'illo',2009,'2021-02-10 21:58:00'),(56,25,NULL,2,3,'laudantium',1899,'2007-05-11 01:30:19'),(57,7,NULL,3,2,'aut',1479,'2010-07-31 20:29:25'),(58,20,9,2,3,'neque',1432,'2008-04-09 05:53:07'),(59,9,NULL,1,3,'perspiciatis',1288,'2015-03-18 12:07:54'),(60,2,NULL,8,1,'inventore',1988,'2021-03-23 00:02:31'),(61,29,11,11,3,'consequuntur',1520,'2009-08-26 19:34:04'),(62,21,NULL,2,3,'deserunt',1615,'2011-02-24 02:59:53'),(63,12,NULL,10,3,'reiciendis',1085,'2007-05-01 15:01:25'),(64,30,NULL,7,1,'velit',1679,'2009-02-03 00:29:16'),(65,8,NULL,10,2,'voluptas',1638,'2007-09-13 17:00:12'),(66,15,NULL,10,1,'quia',1200,'2010-06-24 03:03:33'),(67,8,5,10,1,'voluptatem',1177,'2010-11-09 12:00:48'),(68,23,6,1,2,'officiis',903,'2007-09-18 14:57:05'),(69,22,37,11,1,'ipsam',1545,'2019-11-23 06:47:19'),(70,27,6,7,1,'nulla',1154,'2010-06-26 22:17:10');

SELECT * FROM media;

INSERT INTO media_types VALUES (1,'image'),(3,'music'),(2,'video');

SELECT * FROM media_types;

INSERT INTO rating VALUES (1,6,2),(1,2,9),(1,8,9),(1,14,10),(1,15,8),(1,19,8),(1,20,9),(1,22,2),(1,24,8),(1,26,8),(1,27,8),(1,28,8),(1,29,10),(1,30,9),(1,1,6),(1,3,7),(1,4,10),
							(2,1,2),(2,2,10),(2,4,8),(2,5,9),(2,6,9),(2,7,9),(2,8,5),(2,10,10),(2,12,4),(2,14,8),(2,16,8),(2,19,10),(2,22,3),(2,24,8),(2,26,9),(2,28,7),(2,30,10),
							(3,3,2),(3,5,10),(3,7,8),(3,9,9),(3,11,8),(3,13,8),(3,15,9),(3,17,2),(3,19,10),(3,21,10),(3,23,10),(3,25,6),(3,27,2),(3,28,8),(3,29,9),(3,30,9),(3,1,10),
							(4,2,4),(4,3,8),(4,4,9),(4,5,10),(4,6,10),(4,7,5),(4,10,10),(4,11,7),(4,15,3),(4,16,8),(4,17,9),(4,18,9),(4,19,9),(4,20,8),(4,21,6),(4,23,7),(4,24,10),
							(5,25,1),(5,26,10),(5,27,9),(5,30,9),(5,1,8),(5,6,10),(5,7,7),(5,8,2),(5,9,10),(5,11,9),(5,12,8),(5,13,9),(5,14,9),(5,15,10),(5,16,6),(5,20,5),(5,21,10),
							(6,9,1),(6,10,10),(6,11,10),(6,12,9),(6,13,8),(6,14,3),(6,16,10),(6,17,10),(6,18,9),(6,21,7),(6,22,4),(6,23,9),(6,24,10),(6,25,10),(6,26,4),
							(7,25,5),(7,28,10),(7,29,10),(7,30,7),(7,1,5),(7,2,9),(7,3,10),(7,4,5),(7,5,9),(7,6,5),(7,7,8),(7,9,8),(7,13,10),(7,14,7),(7,15,7),(7,17,6),(7,18,10),
							(8,27,1),(8,28,8),(8,29,10),(8,30,9),(8,1,8),(8,2,10),(8,3,10),(8,6,9),(8,10,6),(8,11,9),(8,12,10),(8,13,8),(8,17,7),(8,22,8),(8,24,6),(8,25,7),(8,26,10),
							(9,19,5),(9,20,8),(9,21,10),(9,22,10),(9,23,6),(9,24,10),(9,25,7),(9,26,6),(9,27,10),(9,29,7),(9,1,7),(9,5,5),(9,7,10),(9,8,10),(9,9,5),(9,10,7),(9,11,10),
							(10,12,1),(10,13,9),(10,14,8),(10,15,9),(10,16,9),(10,17,4),(10,18,10),(10,19,4),(10,20,8),(10,21,9),(10,23,5),(10,24,8),(10,25,9),(10,1,2),(10,2,9),(10,3,6),(10,4,10),
							(11,5,1),(11,6,10),(11,7,7),(11,8,10),(11,9,1),(11,10,7),(11,11,10),(11,12,9),(11,13,1),(11,14,9),(11,15,8),(11,18,10),(11,19,5),(11,20,8),(11,21,5),(11,22,5),(11,23,10);

SELECT * FROM rating;








